# Limpieza de DF de Proyecto

## Limpieza


1. ✔️Convención de nomenclatura: minúscula y _ en vez de espacios 
2. ✔️Estandarización de booleanos : Y/N(general), F/M(gender) 
3. ✔️Eliminar columnas no necesarias: standard_hours, number_children, salary, over18, employee_count.
3. ✔️(b) Borrar same_as_monthly_income por estar repetida. Y years_in_current_role solo hay 34 datos. date_birth borrada pq nos quedamos con age
4. Algunas columnas, como la columna DailyRate son columnas que incluyen valores numéricos decimales. Pero en el DataFrame aparece como columna de tipo string. Deberás ahcer los cambios necesarios para convertirla en columna de tipo numérica.
5. Evaluar si hay valores duplicados y analizar si tiene sentido eliminarlos o mantenerlos
6. Valores inconsistentes, por ejemplo en la columna DistanceFromHome tiene valores negativos.
7. Errores tipográficos en algunos valores de las columnas categóricas. Por ejemplo, en la columna MaritalStatus en vez de "Married" en algunas filas aparece "Marreid".
8. ✔️Columnas redundantes, es decir, columnas que nos dan la misma información expresada de forma diferente.
9. Redondear a dos decimales (DistanceFromHome...)
10. DistanceFromHome numero negativo
11. EmployeeNumber tiene nulos, ¿id + indice?
12. Todos los salarios  quitar $ y pasar tipo a int
13. ✔️Salario no válido, cantidad
14. ✔️JobRole estandarizar mayusculas
16. ✔️DateBirth cambiar a Year (nos interesa la edad) (borramos directamente)
17. WorkLifeBalance quitar decimal

In [12]:
import pandas as pd
import numpy as np
import re

In [13]:
rh  = pd.read_csv("HR_RAW_DATA.csv", index_col = 0)
pd.set_option("display.max.columns", None)

In [15]:
rh.sample(15)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
896,43,No,travel_rarely,"1473,0$",NaN,8,4,Other,1,"526,0",3,1,74,3,2,hEAlTHCaRe ReprESEnTaTive,3,NaN,NaN,2227,4,NaN,Yes,14,"3,0",4,NaN,0,NaN,3,"3,0",5,NaN,0,2,NaN,1980,1000000000$,NaN,NaN,1
48,37,No,NaN,"1372,0$",NaN,1,3,Life Sciences,1,"391,0",4,1,42,3,1,ResEARCh SciENTist,4,Single,NaN,15881,1,NaN,No,12,"3,0",2,"80,0",0,NaN,3,"3,0",17,NaN,5,7,NaN,1986,1000000000$,NaN,NaN,Yes
1179,49,No,NaN,"1091,0$",NaN,-45,2,Technical Degree,1,"431,0",45,1,90,2,4,HEALThCARe REPReSENTatIvE,3,NaN,"13964,0",17810,7,Y,Yes,12,"3,0",4,NaN,0,NaN,2,"3,0",7,NaN,0,7,"13964,0",1974,1000000000$,NaN,NaN,1
655,41,No,NaN,"337,0$",NaN,8,3,NaN,1,"1909,0",3,1,54,3,2,SALes eXECUtiVE,2,NaN,NaN,26841,5,Y,No,21,"4,0",3,"80,0",1,"14,0",3,"3,0",5,NaN,1,4,NaN,1982,1000000000$,NaN,NaN,Yes
761,38,No,travel_frequently,"148,0$",NaN,2,3,NaN,1,NaN,4,1,42,2,1,lAbOrAtOrY TEcHnICiAn,2,NaN,NaN,23826,1,NaN,NaN,22,"4,0",2,NaN,0,"4,0",3,"3,0",4,NaN,3,3,NaN,1985,1000000000$,NaN,NaN,False
823,43,No,NaN,"957,0$",NaN,-26,3,Medical,1,"171,0",2,1,72,4,1,rESEaRcH SciEnTiST,3,Single,"4739,0",16090,4,NaN,NaN,12,"3,0",4,NaN,0,NaN,2,"3,0",3,NaN,1,2,"4739,0",1980,1000000000$,NaN,NaN,Yes
138,46,No,NaN,"406,0$",Sales,3,1,Marketing,1,"1124,0",1,0,Not Available,3,4,MaNAgeR,3,Married,NaN,15596,3,Y,No,12,"3,0",4,NaN,1,NaN,3,"3,0",12,NaN,4,9,NaN,1977,1000000000$,MaNAgeR - Sales,NaN,0
1423,60,No,NaN,nan$,NaN,1,4,NaN,1,"1697,0",3,0,92,1,3,heaLtHCAre rEprEsEntAtiVe,4,Divorced,"10883,0",20467,3,NaN,No,20,"4,0",3,NaN,1,"19,0",2,"4,0",1,NaN,0,0,"10883,0",1963,1000000000$,NaN,NaN,0
1265,59,No,travel_rarely,"142,0$",NaN,3,3,Life Sciences,1,"309,0",3,0,70,2,1,ResEaRCh sciENtIST,4,Married,"2177,0",8456,3,NaN,NaN,17,"3,0",1,NaN,1,"7,0",6,"3,0",1,NaN,0,0,"2177,0",1964,1000000000$,NaN,NaN,Yes
214,33,No,non-travel,"722,0$",NaN,17,3,NaN,1,"992,0",4,0,38,3,4,MaNagER,3,Single,NaN,20489,1,NaN,NaN,11,"3,0",4,NaN,0,"10,0",2,"3,0",10,NaN,6,0,NaN,1990,1000000000$,NaN,NaN,0
152,58,Yes,NaN,"601,0$",NaN,-14,4,Medical,1,"1360,0",14,1,53,2,3,mAnUFACTURIng dIreCtOr,1,Marreid,"10008,0",12023,7,Y,NaN,14,"3,0",4,"80,0",0,NaN,0,"2,0",10,NaN,5,9,"10008,0",1965,1000000000$,NaN,NaN,True
798,31,No,NaN,"670,0$",Research & Development,26,1,NaN,1,"16,0",1,0,Not Available,3,1,rEseArCh SCieNtiST,3,Divorced,NaN,15170,1,NaN,NaN,17,"3,0",4,NaN,1,"5,0",1,"2,0",5,NaN,4,3,NaN,1992,1000000000$,rEseArCh SCieNtiST - Research & Development,NaN,1
107,29,No,travel_rarely,"1389,0$",NaN,21,4,Life Sciences,1,"20,0",2,1,51,4,3,maNufaCturing direcTOr,1,Divorced,NaN,10195,1,Y,No,11,"3,0",3,NaN,1,"10,0",1,"3,0",10,NaN,8,8,NaN,1994,1000000000$,NaN,NaN,0
1546,26,Yes,travel_rarely,"950,0$",NaN,4,4,NaN,1,"401,0",4,0,48,2,2,saLes EXECUtIve,4,Single,"5828,0",8450,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,0,NaN,8,NaN,7,4,"5828,0",1997,1000000000$,NaN,NaN,1
772,40,No,NaN,"616,0$",NaN,2,2,Life Sciences,1,NaN,3,1,99,3,1,LABorAtorY TecHnicIAN,1,Married,"3377,0",25605,4,NaN,NaN,17,"3,0",4,"80,0",1,"7,0",5,"2,0",4,NaN,0,2,"3377,0",1983,1000000000$,NaN,NaN,1

# Estandarizamos los nombres de columnas: todo en minúsculas y espacios como _

In [18]:
# Primer paso: las columnas de todo en mayuscula, pasamos a minúsculas y separamos las palabras#

rh.rename(columns={'NUMCOMPANIESWORKED':'num_companies_worked', 'TOTALWORKINGYEARS':'total_working_years', 'WORKLIFEBALANCE':'work_life_balance','YEARSWITHCURRMANAGER':'years_with_curr_manager','NUMBERCHILDREN':'number_children'},inplace = True)

In [19]:
rh

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,num_companies_worked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,total_working_years,TrainingTimesLastYear,work_life_balance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,years_with_curr_manager,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,number_children,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [20]:
# Segundo paso:todo en minuscula, añadir barra baja separadora

# Patrón regex para identificar la transición de minúsculas a mayúsculas
patron = '(?<=[a-z])(?=[A-Z])'

# Diccionario para almacenar los nuevos nombres de columna
columnas = {column: re.sub(patron,'_', column) for column in rh.columns}

# Renombrar las columnas usando los nuevos nombres
rh.rename(columns=columnas, inplace=True)

# Convertir los nombres de las columnas a minúsculas
rh.columns = [columna.lower() for columna in rh.columns]

#cambiamos manualmente el nombre de una columna
rh.rename(columns = {'employeenumber': 'employee_number', 'employeecount' : 'employee_count'}, inplace = True )

rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over18,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [21]:
rh.dtypes

age                            object
attrition                      object
business_travel                object
daily_rate                     object
department                     object
distance_from_home              int64
education                       int64
education_field                object
employee_count                  int64
employee_number                object
environment_satisfaction        int64
gender                          int64
hourly_rate                    object
job_involvement                 int64
job_level                       int64
job_role                       object
job_satisfaction                int64
marital_status                 object
monthly_income                 object
monthly_rate                    int64
num_companies_worked            int64
over18                         object
over_time                      object
percent_salary_hike             int64
performance_rating             object
relationship_satisfaction       int64
standard_hours                 object
stock_option_level              int64
total_working_years            object
training_times_last_year        int64
work_life_balance              object
years_at_company                int64
years_in_current_role          object
years_since_last_promotion      int64
years_with_curr_manager         int64
same_as_monthly_income         object
date_birth                      int64
salary                         object
role_departament               object
number_children               float64
remote_work                    object
dtype: object

# Acordar estandarización de booleanos : general: Y/N, genre: F/M

In [22]:
# Para género
rh["gender"].replace(to_replace = [0,1], value = ['M', 'F'], inplace = True)

In [23]:
#Para Y/N
rh["over18"].replace(to_replace = [0,1], value = ['N', 'Y'], inplace = True)
rh[["attrition", "over_time"]]= rh[["attrition", "over_time"]].replace(to_replace = ["No","Yes"], value = ['N', 'Y']) #Borrar

In [24]:

rh["remote_work"].replace(to_replace = ["0","1"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["No","Yes"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["False","True"], value = ['N', 'Y'], inplace = True)

#Borramos las columnas inservibles

In [27]:
# .drop standard_hours, number_children, salary, over18, employee_count
rh.drop(labels=["standard_hours", "number_children", "salary", "over18", "employee_count", "years_in_current_role", "same_as_monthly_income", "date_birth"], axis = 1, inplace=True)

# years_in_current_role borrada por tener solo 34 datos: insuficiente
# same_as_monthly_income está repetida

Estandarizamos todos los valores en camel

In [41]:
#creamos variable con todas las columnas object

def camelizar (dato):

    try:
        return dato.title()
    except:
        return dato
    
columnas_object_camel = ["age","attrition","business_travel","daily_rate","department","education_field","employee_number","hourly_rate","job_role","marital_status","monthly_income","over_time","performance_rating","total_working_years","work_life_balance","role_departament","remote_work"]

for columnas in columnas_object_camel:
    rh[columnas]=rh[columnas].apply(camelizar)

In [44]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,"684,0$",NaN,6,3,NaN,"162,0",1,M,51,3,5,Research Director,3,NaN,"19537,0",6462,7,N,13,"3,0",3,0,NaN,5,"3,0",20,15,15,NaN,Y
1,52,N,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",3,M,65,2,5,Manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,11,9,NaN,Y
2,42,N,Travel_Rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",3,M,58,3,5,Manager,4,Married,"19232,0",4933,1,N,11,"3,0",4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y
3,47,N,Travel_Rarely,"359,0$",NaN,2,4,Medical,NaN,1,F,82,3,4,Research Director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,NaN,N
4,46,N,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,1,F,45,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,"3,0",4,1,NaN,5,"3,0",19,2,8,NaN,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,"530,0$",NaN,3,1,Life Sciences,"967,0",3,M,51,2,3,Sales Executive,4,Married,"10325,0",5518,1,NaN,11,NaN,1,1,NaN,6,"3,0",16,3,7,NaN,N
1610,45,N,Non-Travel,"805,0$",NaN,4,2,NaN,"972,0",3,M,57,3,2,Laboratory Technician,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,"2,0",9,0,8,NaN,Y
1611,39,N,Travel_Rarely,"903,0$",NaN,-13,5,NaN,NaN,13,M,41,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,"3,0",4,0,"9,0",3,"3,0",8,0,7,NaN,Y
1612,36,N,Non-Travel,"1229,0$",NaN,8,4,Technical Degree,"990,0",1,M,84,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,"3,0",7,0,7,NaN,Y
1613,46,N,NaN,"566,0$",NaN,7,2,Medical,NaN,4,M,75,3,3,Manufacturing Director,3,NaN,"10845,0",24208,6,NaN,13,"3,0",2,1,NaN,3,"3,0",8,0,7,NaN,N

WorkLifeBalance quitar decimal

In [49]:
rh["work_life_balance"].unique()

array(['3,0', nan, '2,0', '4,0', '1,0'], dtype=object)

In [72]:
#rh["work_life_balance"].replace([","],["."])

#rh["work_life_balece"] = rh["work_life_balance"].str.replace(",",".").astype(float).astype(int)
#rh[["work_life_balance","performance_rating"]]=rh[["work_life_balance","performance_rating"]].replace(',','.')

rh["remote_work"].replace(to_replace = ["0","1"], value = ['N', 'Y'], inplace = True)



#rh['work_life_balance'] = rh['work_life_balance'].astype(float).astype(int) #Error: invalid literal for int() with base 10: '3,0

In [74]:
datos_columnas_comas_a_puntos = ["work_life_balance","performance_rating"]

for columnas in datos_columnas_comas_a_puntos:
    rh[columnas]=rh[columnas].replace(",",".")


#NO FUNCIONA

In [28]:
rh.describe(include=object)

,age,attrition,business_travel,daily_rate,department,education_field,employee_number,gender,hourly_rate,job_role,marital_status,monthly_income,over_time,performance_rating,total_working_years,work_life_balance,role_departament,remote_work
count,1614,1614,842,1614,302,869,1183,1614,1614,1614,963,771,938,1419,1088,1506,302,1614
unique,54,2,3,849,3,6,1079,2,72,1579,5,668,2,2,40,4,301,2
top,35,N,travel_rarely,nan$,Research & Development,Life Sciences,"482,0",M,Not Available,mANager,Married,"6347,0",N,"3,0","10,0","3,0",MaNAgeR - Sales,Y
freq,84,1355,586,124,196,349,2,971,84,4,404,4,682,1205,144,913,2,1000

In [29]:
rh.describe()

,distance_from_home,education,environment_satisfaction,job_involvement,job_level,job_satisfaction,monthly_rate,num_companies_worked,percent_salary_hike,relationship_satisfaction,stock_option_level,training_times_last_year,years_at_company,years_since_last_promotion,years_with_curr_manager
count,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000
mean,4.527261,2.925031,4.294919,2.739777,2.068154,2.738538,14284.495663,2.673482,15.165428,2.704461,0.791202,2.809789,7.132590,2.245973,4.220570
std,14.591913,1.022357,6.993559,0.711567,1.101344,1.106163,7110.414585,2.506152,3.648610,1.079031,0.842396,1.297765,6.124237,3.235665,3.562695
min,-49.000000,1.000000,1.000000,1.000000,1.000000,1.000000,2094.000000,0.000000,11.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.000000,2.000000,2.000000,2.000000,1.000000,2.000000,8001.000000,1.000000,12.000000,2.000000,0.000000,2.000000,3.000000,0.000000,2.000000
50%,5.000000,3.000000,3.000000,3.000000,2.000000,3.000000,14248.500000,2.000000,14.000000,3.000000,1.000000,3.000000,5.000000,1.000000,3.000000
75%,11.000000,4.000000,4.000000,3.000000,3.000000,4.000000,20364.000000,4.000000,18.000000,4.000000,1.000000,3.000000,9.000000,3.000000,7.000000
max,29.000000,5.000000,49.000000,4.000000,5.000000,4.000000,26999.000000,9.000000,25.000000,4.000000,3.000000,6.000000,40.000000,15.000000,17.000000

In [75]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work,"(work_life_balance, performance_rating)"
0,51,N,NaN,"684,0$",NaN,6,3,NaN,"162,0",1,M,51,3,5,Research Director,3,NaN,"19537,0",6462,7,N,13,"3,0",3,0,NaN,5,3.0,20,15,15,NaN,Y,3.0
1,52,N,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",3,M,65,2,5,Manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,3.0,33,11,9,NaN,Y,3.0
2,42,N,Travel_Rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",3,M,58,3,5,Manager,4,Married,"19232,0",4933,1,N,11,"3,0",4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y,NaN
3,47,N,Travel_Rarely,"359,0$",NaN,2,4,Medical,NaN,1,F,82,3,4,Research Director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,NaN,N,NaN
4,46,N,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,1,F,45,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,"3,0",4,1,NaN,5,3.0,19,2,8,NaN,N,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,"530,0$",NaN,3,1,Life Sciences,"967,0",3,M,51,2,3,Sales Executive,4,Married,"10325,0",5518,1,NaN,11,NaN,1,1,NaN,6,3.0,16,3,7,NaN,N,3.0
1610,45,N,Non-Travel,"805,0$",NaN,4,2,NaN,"972,0",3,M,57,3,2,Laboratory Technician,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,2.0,9,0,8,NaN,Y,2.0
1611,39,N,Travel_Rarely,"903,0$",NaN,-13,5,NaN,NaN,13,M,41,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,"3,0",4,0,"9,0",3,3.0,8,0,7,NaN,Y,3.0
1612,36,N,Non-Travel,"1229,0$",NaN,8,4,Technical Degree,"990,0",1,M,84,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,3.0,7,0,7,NaN,Y,3.0
1613,46,N,NaN,"566,0$",NaN,7,2,Medical,NaN,4,M,75,3,3,Manufacturing Director,3,NaN,"10845,0",24208,6,NaN,13,"3,0",2,1,NaN,3,3.0,8,0,7,NaN,N,3.0